In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
df=pd.read_csv("astronauts.csv")

In [5]:
df.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN
1,Loren W. Acton,NaN,NaN,Retired,3/7/1936,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaN,NaN
2,James C. Adamson,1984.0,10.0,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,5/20/1951,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaN,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1/20/1930,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaN,NaN

In [6]:
df.shape

(357, 19)

In [7]:
df.describe()

,Year,Group,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr)
count,330.000000,330.000000,357.000000,357.000000,357.000000,357.000000
mean,1985.106061,11.409091,2.364146,1249.266106,1.246499,7.707283
std,13.216147,5.149962,1.428700,1896.759857,2.056989,13.367973
min,1959.000000,1.000000,0.000000,0.000000,0.000000,0.000000
25%,1978.000000,8.000000,1.000000,289.000000,0.000000,0.000000
50%,1987.000000,12.000000,2.000000,590.000000,0.000000,0.000000
75%,1996.000000,16.000000,3.000000,1045.000000,2.000000,12.000000
max,2009.000000,20.000000,7.000000,12818.000000,10.000000,67.000000

In [8]:
df.dtypes

Name                    object
Year                   float64
Group                  float64
Status                  object
Birth Date              object
Birth Place             object
Gender                  object
Alma Mater              object
Undergraduate Major     object
Graduate Major          object
Military Rank           object
Military Branch         object
Space Flights            int64
Space Flight (hr)        int64
Space Walks              int64
Space Walks (hr)       float64
Missions                object
Death Date              object
Death Mission           object
dtype: object

In [9]:
df.isnull().sum()

Name                     0
Year                    27
Group                   27
Status                   0
Birth Date               0
Birth Place              0
Gender                   0
Alma Mater               1
Undergraduate Major     22
Graduate Major          59
Military Rank          150
Military Branch        146
Space Flights            0
Space Flight (hr)        0
Space Walks              0
Space Walks (hr)         0
Missions                23
Death Date             305
Death Mission          341
dtype: int64

In [10]:
df["Year"].fillna(df["Year"].mean(), inplace=True)

In [12]:
df["Group"].fillna(df["Group"].mean(),inplace=True)

In [13]:
df.isnull().sum()

Name                     0
Year                     0
Group                    0
Status                   0
Birth Date               0
Birth Place              0
Gender                   0
Alma Mater               1
Undergraduate Major     22
Graduate Major          59
Military Rank          150
Military Branch        146
Space Flights            0
Space Flight (hr)        0
Space Walks              0
Space Walks (hr)         0
Missions                23
Death Date             305
Death Mission          341
dtype: int64

In [14]:
df["Alma Mater"].fillna(df["Alma Mater"].mode()[0], inplace=True)

In [15]:
df.isnull().sum()

Name                     0
Year                     0
Group                    0
Status                   0
Birth Date               0
Birth Place              0
Gender                   0
Alma Mater               0
Undergraduate Major     22
Graduate Major          59
Military Rank          150
Military Branch        146
Space Flights            0
Space Flight (hr)        0
Space Walks              0
Space Walks (hr)         0
Missions                23
Death Date             305
Death Mission          341
dtype: int64

In [16]:
df["Undergraduate Major"].fillna(df["Undergraduate Major"].mode()[0], inplace=True)

In [17]:
df["Graduate Major"].fillna(df["Graduate Major"].mode()[0], inplace=True)

In [18]:
df["Military Rank"].fillna(df["Military Rank"].mode()[0], inplace=True)

In [20]:
df["Military Branch"].fillna(df["Military Branch"].mode()[0], inplace=True)

In [21]:
df.isnull().sum()

Name                     0
Year                     0
Group                    0
Status                   0
Birth Date               0
Birth Place              0
Gender                   0
Alma Mater               0
Undergraduate Major      0
Graduate Major           0
Military Rank            0
Military Branch          0
Space Flights            0
Space Flight (hr)        0
Space Walks              0
Space Walks (hr)         0
Missions                23
Death Date             305
Death Mission          341
dtype: int64

In [22]:
df['Missions'].fillna("Unknown", inplace=True)

In [24]:
df.tail()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
352,David A. Wolf,1990.0,13.0,Retired,8/23/1956,"Indianapolis, IN",Male,Purdue University; Indiana University,Electrical Engineering,Medicine,Colonel,US Air Force (Retired),3,4044,7,41.0,STS-58 (Columbia). STS-86/89 (Atlantis/Endeavo...,NaN,NaN
353,Neil W. Woodward III,1998.0,17.0,Retired,7/26/1962,"Chicago, IL",Male,MIT; University of Texas-Austin; George Washin...,Physics,Physics; Business Management,Commander,US Navy,0,0,0,0.0,Unknown,NaN,NaN
354,Alfred M. Worden,1966.0,5.0,Retired,2/7/1932,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaN,NaN
355,John W. Young,1962.0,2.0,Retired,9/24/1930,"San Francisco, CA",Male,Georgia Institute of Technology,Aeronautical Engineering,Aeronautical Engineering,Captain,US Navy (Retired),6,835,3,20.0,"Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...",NaN,NaN
356,George D. Zamka,1998.0,17.0,Retired,6/29/1962,"Jersey City, NJ",Male,US Naval Academy; Florida Institute of Technology,Mathematics,Engineering Management,Colonel,US Marine Corps (Retired),2,692,0,0.0,"STS-120 (Discovery), STS-130 (Endeavor)",NaN,NaN

In [26]:
df["Death Date"].isnull().sum()

305

In [28]:
df["Death Mission"].isnull().sum()

341

In [29]:
df.duplicated().sum()

0

In [30]:
df['Birth Date'] = pd.to_datetime(df['Birth Date'])
df['Death Date'] = pd.to_datetime(df['Death Date'])

In [32]:
df.dtypes

Name                           object
Year                          float64
Group                         float64
Status                         object
Birth Date             datetime64[ns]
Birth Place                    object
Gender                         object
Alma Mater                     object
Undergraduate Major            object
Graduate Major                 object
Military Rank                  object
Military Branch                object
Space Flights                   int64
Space Flight (hr)               int64
Space Walks                     int64
Space Walks (hr)              float64
Missions                       object
Death Date             datetime64[ns]
Death Mission                  object
dtype: object

In [35]:
df['Year'] = df['Year'].astype(int)

In [36]:
df['Group'] = df['Group'].astype(int)

In [37]:
df.dtypes

Name                           object
Year                            int32
Group                           int32
Status                         object
Birth Date             datetime64[ns]
Birth Place                    object
Gender                         object
Alma Mater                     object
Undergraduate Major            object
Graduate Major                 object
Military Rank                  object
Military Branch                object
Space Flights                   int64
Space Flight (hr)               int64
Space Walks                     int64
Space Walks (hr)              float64
Missions                       object
Death Date             datetime64[ns]
Death Mission                  object
dtype: object

In [38]:
df.to_csv('cleaned_data.csv', index=False)